Repository: yicheng2031/XcodeCacheCleaner
Catalog: XcodeCacheCleaner/Localizable.xcstrings
Source language: en
Languages: zh_hans

# about.open_github
source: Open GitHub
zh_hans: 打开 GitHub

# about.privacy
source: Privacy
zh_hans: 隐私说明

# about.support
source: Support & Feedback
zh_hans: 支持与反馈

# action.clean_now
source: Clean Now
zh_hans: 立即清理

# action.quit
source: Quit
zh_hans: 退出

# action.rescan
source: Rescan
zh_hans: 重新检测

# footer.opensource
source: Free and open source
zh_hans: 免费开源

# archive.empty
source: No archives found.
zh_hans: 未发现归档。

# archive.scan_failed.inline.format
source: Archive scan failed: %1$@
zh_hans: 归档扫描失败：%1$@

# categories.header
source: Xcode Cache Categories
zh_hans: Xcode 缓存分类

# category.archives.desc
source: Archives (cannot export/symbolicate old builds after deletion)
zh_hans: 归档（删后无法导出/符号化旧版本）

# category.archives.title
source: Archives
zh_hans: 归档

# category.derivedData.desc
source: Build products and indexes (rebuilt when needed)
zh_hans: 编译产物与索引（需要时会重建）

# category.deviceLogs.desc
source: Device diagnostic logs and crash records
zh_hans: 真机诊断日志与崩溃记录

# category.deviceLogs.title
source: Device Logs
zh_hans: 设备日志

# category.deviceSupport.desc
source: Device symbol files (rebuilt when the device connects)
zh_hans: 真机符号文件（连接设备时会重建）

# category.runtimes.desc
source: iOS/watchOS/tvOS/visionOS runtimes (can be downloaded again)
zh_hans: iOS/watchOS/tvOS/visionOS Runtime（删除后可重新下载）

# category.runtimes.title
source: Simulator Runtimes
zh_hans: 模拟器 Runtime

# category.scan_failed_help.format
source: Scan failed: %@ %@
zh_hans: 扫描失败：%@ %@

# category.simulatorDevices.desc
source: Erase simulator apps and data (does not remove runtimes)
zh_hans: 清空模拟器 App 和数据（不删除 Runtime）

# category.simulatorDevices.title
source: Simulator Devices (Erase Data)
zh_hans: 模拟器设备（清空数据）

# category.simulatorLogsCaches.desc
source: Simulator logs/caches (low impact)
zh_hans: 模拟器日志/缓存（影响较小）

# category.simulatorLogsCaches.title
source: Simulator Logs/Caches
zh_hans: 模拟器日志/缓存

# category.swiftpm.desc
source: SwiftPM package caches (may be fetched or rebuilt again)
zh_hans: SwiftPM 依赖缓存（可能需要重新拉取或重建）

# category.swiftpm.title
source: SwiftPM Caches
zh_hans: SwiftPM 缓存

# category.swiftuiPreviews.desc
source: SwiftUI preview data
zh_hans: SwiftUI 预览数据

# category.swiftuiPreviews.title
source: SwiftUI Previews
zh_hans: SwiftUI 预览

# category.unavailableSimulators.desc
source: Simulator devices whose runtimes are no longer available
zh_hans: Runtime 已不可用的模拟器设备

# category.unavailableSimulators.title
source: Unavailable Simulators
zh_hans: 不可用模拟器

# category.xcodeCaches.desc
source: Xcode caches (may trigger small rebuilds or downloads)
zh_hans: Xcode 缓存（可能触发少量重建或下载）

# category.xcodeCaches.title
source: Xcode Caches
zh_hans: Xcode 缓存

# category.xcodeLogs.desc
source: Xcode activity logs (history will be removed)
zh_hans: Xcode 活动日志（历史记录会被删除）

# category.xcodeLogs.title
source: Xcode Logs
zh_hans: Xcode 日志

# category.xcodeProducts.desc
source: Locally cached Xcode build products
zh_hans: Xcode 本地缓存的构建产物

# category.xcodeProducts.title
source: Xcode Products
zh_hans: Xcode 产品缓存

# error.command_failed.format
source: Command failed: %@ %@
zh_hans: 命令执行失败：%@ %@

# error.invalid_output.format
source: Cannot parse output: %@ %@
zh_hans: 命令输出无法解析：%@ %@

# error.permission.bookmark_resolve_failed
source: Failed to resolve saved permission. Please grant access again.
zh_hans: 权限记录解析失败，请重新授权。

# error.permission.library_not_granted
source: Library access not granted. Click “Grant Access…” and select your ~/Library folder.
zh_hans: 未授权访问 Library。请点击“授权访问…”并选择你的 ~/Library 文件夹。

# item.empty
source: No cleanable items found.
zh_hans: 未发现可清理项目。

# last_scan.format
source: Last scan: %@
zh_hans: 上次扫描：%@

# last_scan.never
source: Never
zh_hans: 未扫描

# menu.about
source: About
zh_hans: 关于

# permission.action.grant
source: Grant Access…
zh_hans: 授权访问…

# permission.panel.message
source: Please select your ~/Library folder (recommended) to enable scanning and cleaning in sandbox mode.
zh_hans: 请选中你的 ~/Library 文件夹（推荐），以便在沙盒模式下进行扫描与清理。

# permission.panel.prompt
source: Select
zh_hans: 选择

# permission.panel.title
source: Grant Folder Access
zh_hans: 授权文件夹访问

# permission.status.granted
source: Library Access: Granted
zh_hans: Library 权限：已授权

# permission.status.not_granted
source: Library Access: Not Granted
zh_hans: Library 权限：未授权

# permission.summary.hint
source: Sandbox mode needs access to ~/Library to scan and clean.
zh_hans: 沙盒模式需要授权访问 ~/Library 才能扫描与清理。

# runtime.copy_fallback
source: Copy Terminal Commands (Fallback)
zh_hans: 复制终端命令（兜底）

# runtime.delete_failed.format
source: Runtime deletion failed (copy commands for Terminal): %@
zh_hans: Runtime 删除失败（可复制命令在终端执行）：%@

# runtime.empty
source: No runtimes found (not installed, or simctl is unavailable).
zh_hans: 未发现 Runtime（可能未安装，或 simctl 不可用）。

# runtime.scan_failed.inline.format
source: Runtime scan failed: %1$@
zh_hans: Runtime 扫描失败：%1$@

# schedule.every1h
source: Auto Clean Every 1 Hour
zh_hans: 每 1 小时自动清理

# schedule.every4h
source: Auto Clean Every 4 Hours
zh_hans: 每 4 小时自动清理

# schedule.every12h
source: Auto Clean Every 12 Hours
zh_hans: 每 12 小时自动清理

# schedule.every24h
source: Auto Clean Every 24 Hours
zh_hans: 每 24 小时自动清理

# schedule.off
source: Auto Clean Off
zh_hans: 关闭定时清理

# schedule.picker.title
source: Auto Clean Schedule
zh_hans: 定时清理计划

# simulator.unavailable.empty
source: No unavailable simulator devices found.
zh_hans: 未发现不可用模拟器设备。

# status.cleaning
source: Cleaning…
zh_hans: 清理中…

# status.scanning
source: Scanning…
zh_hans: 检测中…

# statusbar.label.format
source: Cache %@ GB | Disk %@%%
zh_hans: 缓存 %@ GB | 磁盘 %@%%

# summary.disk.format
source: Disk: %@ free | %@%% used
zh_hans: 磁盘：%@ 可用 | 已用 %@%%

# summary.partial_scan_failed
source: Some categories failed to scan. Click for details.
zh_hans: 部分分类扫描失败。点击查看详情。

# summary.xcode_cache.format
source: Xcode Cache %@ | %@%% of disk
zh_hans: Xcode 缓存 %@ | 占磁盘 %@%%

# toast.cleaned.format
source: %@ cleaned
zh_hans: %@ 已清理完成

# auto_clean.status.format
source: %@ · Auto clean: %@
zh_hans: %@ · 定时：%@

# auto_clean.status.every1h
source: every 1 hour
zh_hans: 每 1 小时

# auto_clean.status.every4h
source: every 4 hours
zh_hans: 每 4 小时

# auto_clean.status.every12h
source: every 12 hours
zh_hans: 每 12 小时

# auto_clean.status.every24h
source: every 24 hours
zh_hans: 每 24 小时
